tutorials/Work/background/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(outlet|bottom|floater|atmosphere)"
    {
        type            zeroGradient;
    }

    inlet
    {
        //type            zeroGradient;
        
        type waveAlpha;
        waveDictName waveDict;
        value uniform 0;
    }
   
    /*
    atmosphere
    {
        type inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }
    */
    
    "(oversetPatch|sides)"
    {
        patchType       overset;
        type            overset;
    }
        
    walls
    {
        type            zeroGradient;//
    }
    
}


// ************************************************************************* //
