tutorials/Work/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    
    outlet
    {
        type   totalPressure;
        p0     uniform 0;
    }
    
    
   "(atmosphere|inlet|floater|bottom)"
    {
        type    fixedFluxPressure;
        value   uniform 0;
    }   
    
    "(oversetPatch|sides)"
    {
         patchType       overset;
         type            overset;
    }
    
    walls
    {
        type    fixedFluxPressure;
        value   uniform 0;
    }
}


// ************************************************************************* //
