tutorials/Work/background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   
    "(inlet|outlet|bottom|atmosphere)"
    {
        type            fixedValue;
        value           $internalField;
    }

    floater
    {
        type            calculated;
        value           $internalField;
    }  
    
    "(oversetPatch|sides)"
    {
         type         zeroGradient;
         value        zeroGradient;
    }
    
    walls
    {
        type            fixedValue;
        value           $internalField;
    }

}
